In [2]:
import pandas as pd
import numpy as np

# File to Load (Remember to Change These)
csvfile = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(csvfile)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [3]:
purchase_data.isnull().sum()
#used isnull to make sure there was a full data set, no missing values

Purchase ID    0
SN             0
Age            0
Gender         0
Item ID        0
Item Name      0
Price          0
dtype: int64

In [4]:
#Looking for total PLAYERS, table shows SN's, but these are the number of PURCHASES
#(use nunique function to separate the values in SN)

purchase_data.SN.nunique()
#UNIQUE will look for ALL different SN's within the column, NUNIQUE gives me the actual total of SN's (grouping)
#duplicate screen nanes together
summary_table = pd.DataFrame({"Total Number of Players" : [purchase_data.SN.nunique()]})
summary_table
#created summary table #1

   Total Number of Players
0                      576

In [5]:
purchase_data.Price.mean()
# look at it as purchase_data is the starting point, and Price (column) is the noun, 
#and . mean is the VERB; took mean of Price column

3.050987179487176

In [6]:
purchase_data["Item ID"].nunique() 
#there are 183 different items(purchases) in column Item ID

183

In [7]:
purchase_data["Purchase ID"].count()
#used .count this time because all we needed is total 
#number of Purchase ID (could also use nunique due to each purchase ID being unique.)

780

In [8]:
purchase_data.Price.sum()

2379.77

In [9]:
summary_table2 = pd.DataFrame({"Number of Unique Items":[purchase_data["Item ID"].nunique()],
                                "Avarage Price":[purchase_data.Price.mean()],
                               "Number of Purchases":[purchase_data["Purchase ID"].count()],
                              "Total Revenue":[purchase_data.Price.sum()]})
summary_table2

   Number of Unique Items  Avarage Price  Number of Purchases  Total Revenue
0                     183       3.050987                  780        2379.77

In [10]:
purchase_data.groupby ("Gender").SN.nunique()

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [11]:
gendertotals = purchase_data.groupby ("Gender").SN.nunique()

In [12]:
gendertotals/576
#Because we made gendertotals into an object or variable, I can use
#this to calculate the percent by dividing by the total players (576)

Gender
Female                   0.140625
Male                     0.840278
Other / Non-Disclosed    0.019097
Name: SN, dtype: float64

In [13]:
#Created two summary tables to get "Total Count" and "Percentage of Players" and merged the two together to display 
#both
summary_table3 = pd.DataFrame({"Total Count":purchase_data.groupby ("Gender").SN.nunique()})
summary_table4 = pd.DataFrame({"Percentage of Players":gendertotals/576})
summary_table_merge = pd.merge(summary_table3,summary_table4, on="Gender")
summary_table_merge

                       Total Count  Percentage of Players
Gender
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

In [14]:
#checking original columns for easy reference
purchase_data.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [15]:
purchase_data.groupby("Gender")["Purchase ID"].count()

#provides purchase count by gender

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [16]:
purchase_data.groupby("Gender")["Price"].mean()
#mean provides by gender what the avarage purchase was

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [17]:
purchase_data.groupby("Gender")["Price"].sum()
#Gives total spent by males, females, other

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [18]:
avgtotal = purchase_data.groupby ("Gender")["Price"].sum()

In [19]:
gendercount = purchase_data.groupby("Gender")["SN"].nunique()
gendercount

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [20]:
avgtotal/gendercount
#created two objects to divide and get totals per person by gender

Gender
Female                   4.468395
Male                     4.065372
Other / Non-Disclosed    4.562727
dtype: float64

In [21]:
summary_table5 = pd.DataFrame({"Purchase Count":purchase_data.groupby("Gender")["Purchase ID"].count()})
summary_table6 = pd.DataFrame({"Average Purchase Price":purchase_data.groupby("Gender")["Price"].mean()})
summary_table7 = pd.DataFrame({"Total Purchase Value":purchase_data.groupby("Gender")["Price"].sum()})
summary_table8 = pd.DataFrame({"Avg Total Purchase per Person":avgtotal/gendercount})

summary_table_merge2 = pd.merge(summary_table5,summary_table6, on="Gender")
summary_table_merge3 = pd.merge(summary_table7,summary_table8, on="Gender")

summary_table_combined = pd.merge(summary_table_merge2,summary_table_merge3, on="Gender")
summary_table_combined

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,4.468395
Male,652,3.017853,1967.64,4.065372
Other / Non-Disclosed,15,3.346000,50.19,4.562727

In [22]:
purchase_data.describe()
#figuring out avarage age for next set of calculations

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [24]:
#created bins and labels for the new column in purchase_data
bins = [0,10,15,20,25,30,35,40,100]

AgeLabels = ["<10","10-14","15-19","20-24","25-29","30-34","35-39","40+"]

In [25]:
#named the new column Age Ranges, used pd.cut to put info into Age Ranges
purchase_data["Age Ranges"] = pd.cut(purchase_data["Age"], bins, labels= AgeLabels)
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [27]:
purchase_data.groupby("Age Ranges")["SN"].nunique()
#Used this line to figure out 'Purchase Count' by Age Ranges for main Age Demographics analysis

Age Ranges
<10       24
10-14     41
15-19    150
20-24    232
25-29     59
30-34     37
35-39     26
40+        7
Name: SN, dtype: int64

In [50]:
purchase_data.groupby("Age Ranges")["Price"].mean()
#Avarage Purchase Price by age

Age Ranges
10 or Younger    3.405000
10-14            2.900000
15-19            3.107800
20-24            3.020431
25-29            2.875584
30-34            2.994423
35-39            3.404545
40-45            3.075714
Name: Price, dtype: float64

In [51]:
purchase_data.groupby("Age Ranges")["Price"].sum()
#Total Purchase Value by age

Age Ranges
10 or Younger    108.96
10-14            156.60
15-19            621.56
20-24            981.64
25-29            221.42
30-34            155.71
35-39            112.35
40-45             21.53
Name: Price, dtype: float64

In [52]:
purchase_data.groupby("Age Ranges")["Price"].sum()/purchase_data.groupby("Age Ranges")["SN"].nunique()
#Avarage Purchase Total per person by age group.

Age Ranges
10 or Younger    4.540000
10-14            3.819512
15-19            4.143733
20-24            4.231207
25-29            3.752881
30-34            4.208378
35-39            4.321154
40-45            3.075714
dtype: float64

In [53]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,15-19
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,35-39
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24